//=============================================================================
//
// スカイキューブ処理 [SkyCubePS.hlsl]
// Author : RIKU TANEKAWA
//
//=============================================================================

//=============================================================================
// グローバル変数宣言
//=============================================================================
samplerCUBE g_SkyCube : register(s0); // キューブマップ用サンプラ
float4x4    g_InvViewProj; // 行列

//=============================================================================
// 頂点シェーダ入力
//=============================================================================
struct VS_INPUT
{
    float4 Pos : POSITION0;
};

//=============================================================================
// 頂点シェーダ出力
//=============================================================================
struct VS_OUTPUT
{
    float4 Pos : POSITION0;
    float3 Dir : TEXCOORD0;
};

//=============================================================================
// 頂点シェーダ本体
//=============================================================================
VS_OUTPUT VSMain(VS_INPUT In)
{
    VS_OUTPUT Out;

    // そのまま描画（XYZRHW）
    Out.Pos = In.Pos;

    // NDC → ワールド方向
    float4 ndc = In.Pos;
    ndc.z = 1.0f;
    ndc.w = 1.0f;

    float4 world = mul(ndc, g_InvViewProj);

    Out.Dir = normalize(world.xyz / world.w);

    return Out;
}

//=============================================================================
// ピクセルシェーダ本体
//=============================================================================
float4 PSMain(VS_OUTPUT In) : COLOR0
{
    // 方向ベクトルの正規化
    float3 dir = normalize(In.Dir);

    return texCUBE(g_SkyCube, dir);
}

//===================================================
// テクニック宣言
//===================================================
technique tech
{
    pass P0
    {
        VertexShader = compile vs_3_0 VSMain();
        PixelShader = compile ps_3_0 PSMain();
    }
}