//=============================================================================
//
// ブロックリスト処理 [BlockList.cpp]
// Author : RIKU TANEKAWA
//
//=============================================================================

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include "BlockList.h"
#include "Collider.h"
#include "RigidBody.h"

namespace ColliderParam
{
	namespace Capsule
	{
		constexpr float RADIUS = 16.5f;
		constexpr float HEIGHT = 40.0f;
	}
}

//=============================================================================
// ボックスブロックのコンストラクタ
//=============================================================================
CBoxBlock::CBoxBlock()
{
	// タグの設定
	SetTag("BoxBlock");
}
//=============================================================================
// ボックスブロックのデストラクタ
//=============================================================================
CBoxBlock::~CBoxBlock()
{
	// なし
}
//=============================================================================
// ボックスブロックのコリジョン生成処理
//=============================================================================
std::shared_ptr<Collider> CBoxBlock::CreateCollisionShape(const D3DXVECTOR3& size)
{
	// ボックスコライダー
	return std::make_shared <BoxCollider>(size);
}
//=============================================================================
// ボックスブロックの衝突瞬間判定処理
//=============================================================================
void CBoxBlock::OnCollisionEnter(IGameObject* other)
{
	if (other->CompareTag("CylinderBlock")) 
	{


	}
}
//=============================================================================
// ボックスブロックの衝突中処理
//=============================================================================
void CBoxBlock::OnCollisionStay(IGameObject* other)
{
	// タグがPlayerだったら
	if (other->CompareTag("Player"))
	{


	}
}
//=============================================================================
// ボックスブロックの衝突後処理
//=============================================================================
void CBoxBlock::OnCollisionExit(IGameObject* other)
{
	// タグがPlayerだったら
	if (other->CompareTag("Player"))
	{


	}
}


//=============================================================================
// シリンダーブロックのコンストラクタ
//=============================================================================
CCylinderBlock::CCylinderBlock()
{
	// タグの設定
	SetTag("CylinderBlock");
}
//=============================================================================
// シリンダーブロックのデストラクタ
//=============================================================================
CCylinderBlock::~CCylinderBlock()
{
	// なし
}
//=============================================================================
// シリンダーブロックのコリジョン生成処理
//=============================================================================
std::shared_ptr<Collider> CCylinderBlock::CreateCollisionShape(const D3DXVECTOR3& size)
{
	D3DXVECTOR3 dirY(0, 1, 0);

	// シリンダーコライダー
	return std::make_shared <CylinderCollider>(size, dirY);
}


//=============================================================================
// スフィアブロックのコンストラクタ
//=============================================================================
CSphereBlock::CSphereBlock()
{
	// タグの設定
	SetTag("SphereBlock");
}
//=============================================================================
// スフィアブロックのデストラクタ
//=============================================================================
CSphereBlock::~CSphereBlock()
{
	// なし
}
//=============================================================================
// スフィアブロックのコリジョン生成処理
//=============================================================================
std::shared_ptr<Collider> CSphereBlock::CreateCollisionShape(const D3DXVECTOR3& size)
{
	// スフィアコライダー
	return std::make_shared <SphereCollider>(size);
}


//=============================================================================
// カプセルブロックのコンストラクタ
//=============================================================================
CCapsuleBlock::CCapsuleBlock()
{
	// タグの設定
	SetTag("CapsuleBlock");
}
//=============================================================================
// カプセルブロックのデストラクタ
//=============================================================================
CCapsuleBlock::~CCapsuleBlock()
{
	// なし
}
//=============================================================================
// カプセルブロックのコリジョン生成処理
//=============================================================================
std::shared_ptr<Collider> CCapsuleBlock::CreateCollisionShape(const D3DXVECTOR3& /*size*/)
{
	// 名前空間ColliderParamの使用
	using namespace ColliderParam;

	// カプセルコライダー
	return std::make_shared <CapsuleCollider>(Capsule::RADIUS, Capsule::HEIGHT);
}
