//===================================================
//
// 魚の処理 [fish.cpp]
// Author:YUTO YOSHIDA
// 
//===================================================

//***************************************************
// インクルードファイル
//***************************************************
#include "fish.h"

//===================================================
// コンストラクタ
//===================================================
CFish::CFish() : 
	m_move(Const::VEC3_NULL)
{
}

//===================================================
// デストラクタ
//===================================================
CFish::~CFish()
{
}

//===================================================
// 生成処理
//===================================================
CFish* CFish::Create(const D3DXVECTOR3& pos, const char* pModelFileName, const int nLife)
{
	CFish* pInstacne = new CFish;

	pInstacne->SetPos(pos);
	pInstacne->SetPath(pModelFileName);
	pInstacne->m_nLife = nLife;

	// 初期化処理
	if (FAILED(pInstacne->Init()))
	{
		pInstacne->Uninit();
		pInstacne = nullptr;
		return nullptr;
	}
	return pInstacne;
}

//===================================================
// 初期化処理
//===================================================
HRESULT CFish::Init(void)
{
	// 初期化処理
	if (FAILED(CObjectX::Init()))
	{
		return E_FAIL;
	}
	return S_OK;
}

//===================================================
// 終了処理
//===================================================
void CFish::Uninit(void)
{
	CObjectX::Uninit();
}

//===================================================
// 更新処理
//===================================================
void CFish::Update(void)
{
	// 位置の取得
	D3DXVECTOR3 pos = CObjectX::GetPos();

	m_move.x += (0.0f - m_move.x) * 0.1f;
	m_move.z += (0.0f - m_move.z) * 0.1f;

	// 位置の更新処理
	pos += m_move;

	m_nLife--;

	// 位置の設定
	CObjectX::SetPos(pos);

	CObjectX::Update();
}

//===================================================
// 描画処理
//===================================================
void CFish::Draw(void)
{
	CObjectX::Draw();
}

//===================================================
// 生きてるかどうか
//===================================================
bool CFish::GetALive(void) const
{
	return (m_nLife >= 0);
}
