//===================================================
//
// 魚の処理 [fish.cpp]
// Author:YUTO YOSHIDA
// 
//===================================================

//***************************************************
// インクルードファイル
//***************************************************
#include "fish.h"

//===================================================
// コンストラクタ
//===================================================
CFish::CFish()
{
}

//===================================================
// デストラクタ
//===================================================
CFish::~CFish()
{
}

//===================================================
// 生成処理
//===================================================
CFish* CFish::Create(const D3DXVECTOR3& pos, const char* pModelFileName)
{
	CFish* pInstacne = new CFish;

	pInstacne->SetPos(pos);
	pInstacne->SetPath(pModelFileName);

	// 初期化処理
	if (FAILED(pInstacne->Init()))
	{
		pInstacne->Uninit();
		pInstacne = nullptr;
		return nullptr;
	}
	return pInstacne;
}

//===================================================
// 初期化処理
//===================================================
HRESULT CFish::Init(void)
{
	// 初期化処理
	if (FAILED(CObjectX::Init()))
	{
		return E_FAIL;
	}
	return S_OK;
}

//===================================================
// 終了処理
//===================================================
void CFish::Uninit(void)
{
	CObjectX::Uninit();
}

//===================================================
// 更新処理
//===================================================
void CFish::Update(void)
{
	CObjectX::Update();
}

//===================================================
// 描画処理
//===================================================
void CFish::Draw(void)
{
	CObjectX::Draw();
}
