//===================================================
//
// プランクトンを操作し、管理するクラス [plankton_controller.cpp]
// Author:YUTO YOSHIDA
// 
//===================================================

//***************************************************
// インクルードファイル
//***************************************************
#include "plankton_controller.h"
#include "plankton.h"

//===================================================
// コンストラクタ
//===================================================
CPlanktonController::CPlanktonController()
{
}

//===================================================
// デストラクタ
//===================================================
CPlanktonController::~CPlanktonController()
{
}

//===================================================
// プランクトンの生成処理
//===================================================
HRESULT CPlanktonController::CreatePlankton(const D3DXVECTOR3& pos, const D3DXVECTOR2& size)
{
	// プランクトンの生成処理
	CPlankton::Create(pos, size);

	return S_OK;
}
