//===================================================
//
// タイトルシーン [title.cpp]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// インクルードファイル
//***************************************************
#include "title.h"

#include "input.h"
#include "manager.h"
#include "game.h"
#include "object2d.h"

//===================================================
// コンストラクタ
//===================================================
CTitle::CTitle() : 
	CScene(CScene::MODE_TITLE)
{
}

//===================================================
// デストラクタ
//===================================================
CTitle::~CTitle()
{
}

//===================================================
// 初期化処理
//===================================================
HRESULT CTitle::Init(void)
{

	CObject2D::Create(
		Const::CENTER_POS_2D,
		{ 600.0f,150.0f },
		Const::WHITE,
		"title.png",
		0.0f);

	return S_OK;
}

//===================================================
// 終了処理
//===================================================
void CTitle::Uninit(void)
{
}

//===================================================
// 更新処理
//===================================================
void CTitle::Update(void)
{
#ifdef _DEBUG
	// マネージャーの取得
	CManager* pManager = CManager::GetInstance();

	// キーボードの取得
	CInputKeyboard* pKeyboard = pManager->GetInputKeyboard();

	if (pKeyboard->GetTrigger(DIK_F9))
	{
		pManager->BeginFade(std::make_unique<CGame>());
	}
#endif // _DEBUG
}

//===================================================
// 描画処理
//===================================================
void CTitle::Draw(void)
{

}