//===================================================
//
// 当たり判定の結果の構造体をまとめたh [collision_result.h]
// Author:YUTO YOSHIDA
// 
// 判定される対象がメンバ変数で判定結果を持つ
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _COLLISION_RESULT_H_
#define _COLLISION_RESULT_H_

//***************************************************
// 当たり判定の結果の構造体をまとめた名前空間の定義
//***************************************************
namespace CollisionResult
{
	// メッシュフィールドの判定結果
	struct MeshField
	{
		D3DXVECTOR3 normal;			// 当たった箇所の法線
		float		fHeight;		// 押し出し位置
		bool		bHit = false;	// 当たったかどうか
	};
}
#endif