//===================================================
//
// プランクトンを操作し、管理するクラス [plankton_controller.h]
// Author:YUTO YOSHIDA
// 
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _PLANKTON_CONTROLLER_H_
#define _PLANKTON_CONTROLLER_H_

//***************************************************
// インクルードファイル
//***************************************************

//***************************************************
// 前方宣言
//***************************************************
class CPlankton;	// プランクトンクラス

//***************************************************
// プランクトンのコントローラーのクラスの定義
//***************************************************
class CPlanktonController
{
public:
	CPlanktonController();
	~CPlanktonController();

	HRESULT CreatePlankton(const D3DXVECTOR3& pos, const D3DXVECTOR2& size);
private:
};
#endif