//===================================================
//
// リザルトシーン [result.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _RESULT_H_
#define _RESULT_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "scene.h"

//***************************************************
// リザルトシーンのクラスの定義
//***************************************************
class CResult : public CScene
{
public:
	CResult();
	~CResult();

	HRESULT Init	(void) override;
	void	Uninit	(void) override;
	void	Update	(void) override;
	void	Draw	(void) override;
private:
};
#endif