//===================================================
//
// チューリアルシーン [tutorial.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "scene.h"

//***************************************************
// チュートリアルシーンのクラスの定義
//***************************************************
class CTutorial : public CScene
{
public:
	CTutorial();
	~CTutorial();

	HRESULT Init	(void) override;
	void	Uninit	(void) override;
	void	Update	(void) override;
	void	Draw	(void) override;
private:
};
#endif