//===================================================
//
// クジラの状態マシーン [whale_state.h]
// Author:YUTO YOSHIDA
// 
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _WHALE_STATE_H_
#define _WHALE_STATE_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "State.h"

//***************************************************
// 前方宣言
//***************************************************
class CWhale;	// クジラクラス

//***************************************************
// ニュートラル状態の処理
//***************************************************
class CWhaleStateNeutral : public StateBase<CWhale>
{
public:
	CWhaleStateNeutral();
	~CWhaleStateNeutral();

	void OnStart(CWhale* pWhale) override;
	void OnUpdate(CWhale* pWhale) override;
	void OnExit(CWhale* pWhale) override {}

private:
};
#endif